---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarLayoutRule.MinimumClearSpacing
enum: Autodesk.Revit.DB.Structure.RebarLayoutRule
source: html/bc9034d0-5055-c55e-2686-b221d156ed48.htm
---
# Autodesk.Revit.DB.Structure.RebarLayoutRule.MinimumClearSpacing

The minimum distance between rebar is specified by input,
 and the number of rebar changes based on the length of rebar set.
 This spacing is maintained even if the rebar size changes.